{
  "experience": [
    {
      "title": "Lead Product Designer & Interim Head of UX",
      "company": "Gelato",
      "url": "https://www.gelato.com",
      "start": "2022",
      "end": "Present",
      "description": "Leading UX across multiple business units, ensuring design consistency and a user-centered approach. Responsible for UX strategy, design systems, and scalable experiences across Gelato’s platform. Focused on scaling design operations, strengthening our design system, and fostering a high-performing team culture. Working closely with product and engineering to design seamless workflows and ensure a consistent experience across SaaS products."
    },
    {
      "title": "Lead Product Designer",
      "company": "Smart Protection",
      "url": "https://www.smartprotection.com",
      "start": "2020",
      "end": "2022",
      "description": "Led UX and product design for Smart Protection's platform, protecting brands against online threats. Established the company's design system (Naós), improved usability across key tools, and worked hands-on with research, IA, and UX strategy."
    },
    {
      "title": "Head of Product & Technology",
      "company": "Astara Store",
      "url": "https://astarastore.com/",
      "start": "2019",
      "end": "2020",
      "description": "Redesigned the automotive e-commerce experience, making it possible to buy a car or motorbike entirely online. Built digital storefronts for brands like Kia, Mitsubishi, Hyundai, and SsangYong, designing flexible systems for multi-brand dealerships."
    },
    {
      "title": "Senior Product Manager (UX)",
      "company": "Clarity AI",
      "url": "https://clarity.ai",
      "start": "2018",
      "end": "2019",
      "description": "Translating complex ESG data into actionable insights for investors. Led the UX effort in structuring Clarity's platform, designing information flows, and improving the way users evaluate the social and environmental impact of their investments."
    },
    {
      "title": "Digital Product Designer",
      "company": "Freelance",
      "start": "2017",
      "end": "2018",
      "description": "Helping startups refine their product experience, define their UX strategy, and scale their design systems. Notable project: Coowry, a micropayment platform for unbanked users, where I revamped their web and mobile experience from the ground up."
    },
    {
      "title": "Co-Founder & CPO/CTO",
      "company": "Emtrics",
      "start": "2011",
      "end": "2017",
      "description": "Built one of the first emoticon-based customer feedback platforms, rethinking how businesses measure customer satisfaction. Led the design, research, and product strategy from early-stage growth to market adoption—until."
    }
  ]
}
